# Supervised ML - Predict Titanic Survival

## Logistic Regression - classification with binary response variable

- In logistic regression, the outcome (dependent variable) has only a limited number of possible values. Logistic regression is used when the response variable is ``categorical`` in nature. Vs Linear regression is used when your response variable is ``continuous`` (Ex: Predict height based on weight).

- Mathematically, a binary logistic model has a dependent variable with two possible values, such as pass/fail, win/lose, alive/dead or healthy/sick; these are represented by an indicator variable, where the two values are labeled "0" and "1"

In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

from sklearn import datasets, linear_model
from sklearn.linear_model import LogisticRegression

### Load Training Dataset - Titanic_TrainingDataset.csv

In [2]:
train=pd.read_csv("Titanic_TrainingDataset.csv")
train.shape

(891, 12)

In [3]:
train.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Select the columns we need for building model + clean up the data

In [4]:
df=train[['Survived','Pclass','Sex','Age','Fare']]

In [5]:
df.head(5)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [6]:
#change male to 1 and female to 0
df["Sex"] = df["Sex"].apply(lambda sex:1 if sex=="male" else 0)

In [7]:
df.head(5)

   Survived  Pclass  Sex   Age     Fare
0         0       3    1  22.0   7.2500
1         1       1    0  38.0  71.2833
2         1       3    0  26.0   7.9250
3         1       1    0  35.0  53.1000
4         0       3    1  35.0   8.0500

In [8]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [9]:
#handle missing values of age
df["Age"] = df["Age"].fillna(df["Age"].median())
#df["Fare"] = df["Fare"].fillna(df["Fare"].median())

In [10]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [11]:
X_train = df.drop("Survived", axis=1) #predictors from training 
Y_train = df["Survived"]

In [12]:
X_train.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [13]:
Y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

### Train the model using sklearn.linear_model.LogisticRegression algorithm - one of many many available algorithms in sklearn

https://scikit-learn.org/stable/

In [14]:
#define the logistic regression model
logreg = LogisticRegression() 

# Fit the model according to the given training data - X should be a matrix (2D) and y should be a vector (1D)
titanicmodel = logreg.fit(X_train, Y_train)

In [15]:
# Our model is trained now
type(titanicmodel)

sklearn.linear_model._logistic.LogisticRegression

## Let's predict the outcome using the model

In [16]:
data = {'Pclass': [3, 2], 'Sex': [1, 0],'Age': [40, 35], 'Fare': [7.98, 8.99]}
passengers = pd.DataFrame(data)
passengers

   Pclass  Sex  Age  Fare
0       3    1   40  7.98
1       2    0   35  8.99

In [17]:
predictions = titanicmodel.predict(passengers)
print(predictions)

[0 1]

### Load Test Dataset - Titanic_TestDataset.csv

- Notice that the test dataset doesn't have Survived column which is predicted value

In [18]:
test=pd.read_csv("Titanic_TestDataset.csv")
test.shape

(418, 11)

In [19]:
## lets look at the test data
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### Select the columns we need for testing the model + clean up the data

In [20]:
X_test=test[['Pclass','Sex','Age','Fare']]

In [21]:
X_test["Sex"] = X_test["Sex"].apply(lambda sex:1 if sex=="male" else 0)

In [22]:
X_test.isnull().sum()

Pclass     0
Sex        0
Age       86
Fare       1
dtype: int64

In [23]:
X_test["Age"] = X_test["Age"].fillna(X_test["Age"].median())

In [24]:
X_test=X_test.dropna()

In [25]:
X_test.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [26]:
X_test.head(5)

   Pclass  Sex   Age     Fare
0       3    1  34.5   7.8292
1       3    0  47.0   7.0000
2       2    1  62.0   9.6875
3       3    1  27.0   8.6625
4       3    0  22.0  12.2875

## Predict survival for Test dataset - "Batch mode"

In [27]:
# Predict class labels for samples in test dataset
Y_predicted = titanicmodel.predict(X_test)

In [28]:
Y_predicted[2:15]

array([0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1], dtype=int64)

In [29]:
X_test['SurvivedPred'] = Y_predicted

In [30]:
X_test.head(15)

    Pclass  Sex   Age     Fare  SurvivedPred
0        3    1  34.5   7.8292             0
1        3    0  47.0   7.0000             0
2        2    1  62.0   9.6875             0
3        3    1  27.0   8.6625             0
4        3    0  22.0  12.2875             1
5        3    1  14.0   9.2250             0
6        3    0  30.0   7.6292             1
7        2    1  26.0  29.0000             0
8        3    0  18.0   7.2292             1
9        3    1  21.0  24.1500             0
10       3    1  27.0   7.8958             0
11       1    1  46.0  26.0000             0
12       1    0  23.0  82.2667             1
13       2    1  63.0  26.0000             0
14       1    0  47.0  61.1750             1

In [31]:
X_test.sort_values(["Sex", "SurvivedPred"], ascending=False)

     Pclass  Sex   Age      Fare  SurvivedPred
23        1    1  21.0   61.3792             1
41        1    1  27.0   26.5500             1
50        1    1  24.0   60.0000             1
64        1    1  13.0  262.3750             1
94        1    1  25.0   26.0000             1
..      ...  ...   ...       ...           ...
153       3    0  36.0   12.1833             0
214       3    0  38.0    7.7750             0
309       3    0  45.0   14.1083             0
313       3    0  37.0    7.7500             0
347       3    0  38.0    7.2292             0

[417 rows x 5 columns]